import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

In [8]:
data = {
    "name" :["a","b","c","d","a","c"],
    "eng" : [8,7,5,8,8,4],
    "hindi": [2,3,4,5,2,6]
}

In [15]:
df = pd.DataFrame(data)

In [16]:
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
4    a    8      2
5    c    4      6

In [17]:
 df.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [19]:
df["duplicated"] = df.duplicated()

In [22]:
df

  name  eng  hindi  duplicated
0    a    8      2       False
1    b    7      3       False
2    c    5      4       False
3    d    8      5       False
4    a    8      2       False
5    c    4      6       False

In [23]:
df.drop_duplicates(inplace = True)

In [24]:
df

  name  eng  hindi  duplicated
0    a    8      2       False
1    b    7      3       False
2    c    5      4       False
3    d    8      5       False
5    c    4      6       False

## handling duplicate data in real data

In [27]:
data1 = pd.read_csv("D:/Data_Analytics/Machine learning/archive/loan_data_set.csv")

In [28]:
data1.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [30]:
data1.shape

(614, 13)

In [32]:
data1.drop_duplicates(inplace=True)

In [37]:
data1.shape   # we dont have any duplicate values in these data set

(614, 13)

In [39]:
data1.duplicated().value_counts()

False    614
Name: count, dtype: int64